In [1]:
import numpy as np 
import pandas as pd

In [10]:
data = pd.read_excel('data.xlsx', sheet_name='Sheet1')

In [11]:
data

   Train No.  speed      city
0       1234    120  New York
1       5678    129    London
2       1928     78     Paris
3       2736     93     Paris

In [12]:
data.iloc[0,0] = 34

In [13]:
data.to_excel('data.xlsx', sheet_name="Sheet2")

In [14]:
data

   Train No.  speed      city
0         34    120  New York
1       5678    129    London
2       1928     78     Paris
3       2736     93     Paris